{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "left_eye_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 36, 60, 1], "dtype": "float32", "sparse": false, "name": "left_eye_input"}, "inbound_nodes": []}, {"name": "right_eye_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 36, 60, 1], "dtype": "float32", "sparse": false, "name": "right_eye_input"}, "inbound_nodes": []}, {"name": "Left_Layer_1", "class_name": "Conv2D", "config": {"name": "Left_Layer_1", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["left_eye_input", 0, 0, {}]]]}, {"name": "Right_Layer_1", "class_name": "Conv2D", "config": {"name": "Right_Layer_1", "trainable": true, "dtype": "float32", "filters": 10, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["right_eye_input", 0, 0, {}]]]}, {"name": "Left_DS_2", "class_name": "DepthwiseConv2D", "config": {"name": "Left_DS_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Left_Layer_1", 0, 0, {}]]]}, {"name": "Right_DS_2", "class_name": "DepthwiseConv2D", "config": {"name": "Right_DS_2", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Right_Layer_1", 0, 0, {}]]]}, {"name": "Left_DS_BN_2", "class_name": "BatchNormalization", "config": {"name": "Left_DS_BN_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_DS_2", 0, 0, {}]]]}, {"name": "Right_DS_BN_2", "class_name": "BatchNormalization", "config": {"name": "Right_DS_BN_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_DS_2", 0, 0, {}]]]}, {"name": "Left_DS_act_2", "class_name": "Activation", "config": {"name": "Left_DS_act_2", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_DS_BN_2", 0, 0, {}]]]}, {"name": "Right_DS_act_2", "class_name": "Activation", "config": {"name": "Right_DS_act_2", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_DS_BN_2", 0, 0, {}]]]}, {"name": "Left_PW_2", "class_name": "Conv2D", "config": {"name": "Left_PW_2", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Left_DS_act_2", 0, 0, {}]]]}, {"name": "Right_PW_2", "class_name": "Conv2D", "config": {"name": "Right_PW_2", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Right_DS_act_2", 0, 0, {}]]]}, {"name": "Left_PW_BN_2", "class_name": "BatchNormalization", "config": {"name": "Left_PW_BN_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_PW_2", 0, 0, {}]]]}, {"name": "Right_PW_BN_2", "class_name": "BatchNormalization", "config": {"name": "Right_PW_BN_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_PW_2", 0, 0, {}]]]}, {"name": "Left_PW_act_2", "class_name": "Activation", "config": {"name": "Left_PW_act_2", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_PW_BN_2", 0, 0, {}]]]}, {"name": "Right_PW_act_2", "class_name": "Activation", "config": {"name": "Right_PW_act_2", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_PW_BN_2", 0, 0, {}]]]}, {"name": "Left_DS_3", "class_name": "DepthwiseConv2D", "config": {"name": "Left_DS_3", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Left_PW_act_2", 0, 0, {}]]]}, {"name": "Right_DS_3", "class_name": "DepthwiseConv2D", "config": {"name": "Right_DS_3", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Right_PW_act_2", 0, 0, {}]]]}, {"name": "Left_DS_BN_3", "class_name": "BatchNormalization", "config": {"name": "Left_DS_BN_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_DS_3", 0, 0, {}]]]}, {"name": "Right_DS_BN_3", "class_name": "BatchNormalization", "config": {"name": "Right_DS_BN_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_DS_3", 0, 0, {}]]]}, {"name": "Left_DS_act_3", "class_name": "Activation", "config": {"name": "Left_DS_act_3", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_DS_BN_3", 0, 0, {}]]]}, {"name": "Right_DS_act_3", "class_name": "Activation", "config": {"name": "Right_DS_act_3", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_DS_BN_3", 0, 0, {}]]]}, {"name": "Left_PW_3", "class_name": "Conv2D", "config": {"name": "Left_PW_3", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Left_DS_act_3", 0, 0, {}]]]}, {"name": "Right_PW_3", "class_name": "Conv2D", "config": {"name": "Right_PW_3", "trainable": true, "dtype": "float32", "filters": 20, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Right_DS_act_3", 0, 0, {}]]]}, {"name": "Left_PW_BN_3", "class_name": "BatchNormalization", "config": {"name": "Left_PW_BN_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_PW_3", 0, 0, {}]]]}, {"name": "Right_PW_BN_3", "class_name": "BatchNormalization", "config": {"name": "Right_PW_BN_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_PW_3", 0, 0, {}]]]}, {"name": "Left_PW_act_3", "class_name": "Activation", "config": {"name": "Left_PW_act_3", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_PW_BN_3", 0, 0, {}]]]}, {"name": "Right_PW_act_3", "class_name": "Activation", "config": {"name": "Right_PW_act_3", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_PW_BN_3", 0, 0, {}]]]}, {"name": "Left_DS_4", "class_name": "DepthwiseConv2D", "config": {"name": "Left_DS_4", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Left_PW_act_3", 0, 0, {}]]]}, {"name": "Right_DS_4", "class_name": "DepthwiseConv2D", "config": {"name": "Right_DS_4", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Right_PW_act_3", 0, 0, {}]]]}, {"name": "Left_DS_BN_4", "class_name": "BatchNormalization", "config": {"name": "Left_DS_BN_4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_DS_4", 0, 0, {}]]]}, {"name": "Right_DS_BN_4", "class_name": "BatchNormalization", "config": {"name": "Right_DS_BN_4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_DS_4", 0, 0, {}]]]}, {"name": "Left_DS_act_4", "class_name": "Activation", "config": {"name": "Left_DS_act_4", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_DS_BN_4", 0, 0, {}]]]}, {"name": "Right_DS_act_4", "class_name": "Activation", "config": {"name": "Right_DS_act_4", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_DS_BN_4", 0, 0, {}]]]}, {"name": "Left_PW_4", "class_name": "Conv2D", "config": {"name": "Left_PW_4", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Left_DS_act_4", 0, 0, {}]]]}, {"name": "Right_PW_4", "class_name": "Conv2D", "config": {"name": "Right_PW_4", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Right_DS_act_4", 0, 0, {}]]]}, {"name": "Left_PW_BN_4", "class_name": "BatchNormalization", "config": {"name": "Left_PW_BN_4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_PW_4", 0, 0, {}]]]}, {"name": "Right_PW_BN_4", "class_name": "BatchNormalization", "config": {"name": "Right_PW_BN_4", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_PW_4", 0, 0, {}]]]}, {"name": "Left_PW_act_4", "class_name": "Activation", "config": {"name": "Left_PW_act_4", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_PW_BN_4", 0, 0, {}]]]}, {"name": "Right_PW_act_4", "class_name": "Activation", "config": {"name": "Right_PW_act_4", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_PW_BN_4", 0, 0, {}]]]}, {"name": "Left_DS_5", "class_name": "DepthwiseConv2D", "config": {"name": "Left_DS_5", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Left_PW_act_4", 0, 0, {}]]]}, {"name": "Right_DS_5", "class_name": "DepthwiseConv2D", "config": {"name": "Right_DS_5", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Right_PW_act_4", 0, 0, {}]]]}, {"name": "Left_DS_BN_5", "class_name": "BatchNormalization", "config": {"name": "Left_DS_BN_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_DS_5", 0, 0, {}]]]}, {"name": "Right_DS_BN_5", "class_name": "BatchNormalization", "config": {"name": "Right_DS_BN_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_DS_5", 0, 0, {}]]]}, {"name": "Left_DS_act_5", "class_name": "Activation", "config": {"name": "Left_DS_act_5", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_DS_BN_5", 0, 0, {}]]]}, {"name": "Right_DS_act_5", "class_name": "Activation", "config": {"name": "Right_DS_act_5", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_DS_BN_5", 0, 0, {}]]]}, {"name": "Left_PW_5", "class_name": "Conv2D", "config": {"name": "Left_PW_5", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Left_DS_act_5", 0, 0, {}]]]}, {"name": "Right_PW_5", "class_name": "Conv2D", "config": {"name": "Right_PW_5", "trainable": true, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Right_DS_act_5", 0, 0, {}]]]}, {"name": "Left_PW_BN_5", "class_name": "BatchNormalization", "config": {"name": "Left_PW_BN_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_PW_5", 0, 0, {}]]]}, {"name": "Right_PW_BN_5", "class_name": "BatchNormalization", "config": {"name": "Right_PW_BN_5", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_PW_5", 0, 0, {}]]]}, {"name": "Left_PW_act_5", "class_name": "Activation", "config": {"name": "Left_PW_act_5", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_PW_BN_5", 0, 0, {}]]]}, {"name": "Right_PW_act_5", "class_name": "Activation", "config": {"name": "Right_PW_act_5", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_PW_BN_5", 0, 0, {}]]]}, {"name": "Left_DS_6", "class_name": "DepthwiseConv2D", "config": {"name": "Left_DS_6", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Left_PW_act_5", 0, 0, {}]]]}, {"name": "Right_DS_6", "class_name": "DepthwiseConv2D", "config": {"name": "Right_DS_6", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Right_PW_act_5", 0, 0, {}]]]}, {"name": "Left_DS_BN_6", "class_name": "BatchNormalization", "config": {"name": "Left_DS_BN_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_DS_6", 0, 0, {}]]]}, {"name": "Right_DS_BN_6", "class_name": "BatchNormalization", "config": {"name": "Right_DS_BN_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_DS_6", 0, 0, {}]]]}, {"name": "Left_DS_act_6", "class_name": "Activation", "config": {"name": "Left_DS_act_6", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_DS_BN_6", 0, 0, {}]]]}, {"name": "Right_DS_act_6", "class_name": "Activation", "config": {"name": "Right_DS_act_6", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_DS_BN_6", 0, 0, {}]]]}, {"name": "Left_PW_6", "class_name": "Conv2D", "config": {"name": "Left_PW_6", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Left_DS_act_6", 0, 0, {}]]]}, {"name": "Right_PW_6", "class_name": "Conv2D", "config": {"name": "Right_PW_6", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Right_DS_act_6", 0, 0, {}]]]}, {"name": "Left_PW_BN_6", "class_name": "BatchNormalization", "config": {"name": "Left_PW_BN_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_PW_6", 0, 0, {}]]]}, {"name": "Right_PW_BN_6", "class_name": "BatchNormalization", "config": {"name": "Right_PW_BN_6", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_PW_6", 0, 0, {}]]]}, {"name": "Left_PW_act_6", "class_name": "Activation", "config": {"name": "Left_PW_act_6", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_PW_BN_6", 0, 0, {}]]]}, {"name": "Right_PW_act_6", "class_name": "Activation", "config": {"name": "Right_PW_act_6", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_PW_BN_6", 0, 0, {}]]]}, {"name": "Left_DS_7", "class_name": "DepthwiseConv2D", "config": {"name": "Left_DS_7", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Left_PW_act_6", 0, 0, {}]]]}, {"name": "Right_DS_7", "class_name": "DepthwiseConv2D", "config": {"name": "Right_DS_7", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Right_PW_act_6", 0, 0, {}]]]}, {"name": "Left_DS_BN_7", "class_name": "BatchNormalization", "config": {"name": "Left_DS_BN_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_DS_7", 0, 0, {}]]]}, {"name": "Right_DS_BN_7", "class_name": "BatchNormalization", "config": {"name": "Right_DS_BN_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_DS_7", 0, 0, {}]]]}, {"name": "Left_DS_act_7", "class_name": "Activation", "config": {"name": "Left_DS_act_7", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_DS_BN_7", 0, 0, {}]]]}, {"name": "Right_DS_act_7", "class_name": "Activation", "config": {"name": "Right_DS_act_7", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_DS_BN_7", 0, 0, {}]]]}, {"name": "Left_PW_7", "class_name": "Conv2D", "config": {"name": "Left_PW_7", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Left_DS_act_7", 0, 0, {}]]]}, {"name": "Right_PW_7", "class_name": "Conv2D", "config": {"name": "Right_PW_7", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Right_DS_act_7", 0, 0, {}]]]}, {"name": "Left_PW_BN_7", "class_name": "BatchNormalization", "config": {"name": "Left_PW_BN_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_PW_7", 0, 0, {}]]]}, {"name": "Right_PW_BN_7", "class_name": "BatchNormalization", "config": {"name": "Right_PW_BN_7", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_PW_7", 0, 0, {}]]]}, {"name": "Left_PW_act_7", "class_name": "Activation", "config": {"name": "Left_PW_act_7", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_PW_BN_7", 0, 0, {}]]]}, {"name": "Right_PW_act_7", "class_name": "Activation", "config": {"name": "Right_PW_act_7", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_PW_BN_7", 0, 0, {}]]]}, {"name": "Left_DS_8", "class_name": "DepthwiseConv2D", "config": {"name": "Left_DS_8", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Left_PW_act_7", 0, 0, {}]]]}, {"name": "Right_DS_8", "class_name": "DepthwiseConv2D", "config": {"name": "Right_DS_8", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Right_PW_act_7", 0, 0, {}]]]}, {"name": "Left_DS_BN_8", "class_name": "BatchNormalization", "config": {"name": "Left_DS_BN_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_DS_8", 0, 0, {}]]]}, {"name": "Right_DS_BN_8", "class_name": "BatchNormalization", "config": {"name": "Right_DS_BN_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_DS_8", 0, 0, {}]]]}, {"name": "Left_DS_act_8", "class_name": "Activation", "config": {"name": "Left_DS_act_8", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_DS_BN_8", 0, 0, {}]]]}, {"name": "Right_DS_act_8", "class_name": "Activation", "config": {"name": "Right_DS_act_8", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_DS_BN_8", 0, 0, {}]]]}, {"name": "Left_PW_8", "class_name": "Conv2D", "config": {"name": "Left_PW_8", "trainable": true, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Left_DS_act_8", 0, 0, {}]]]}, {"name": "Right_PW_8", "class_name": "Conv2D", "config": {"name": "Right_PW_8", "trainable": true, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "uniform", "seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["Right_DS_act_8", 0, 0, {}]]]}, {"name": "Left_PW_BN_8", "class_name": "BatchNormalization", "config": {"name": "Left_PW_BN_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_PW_8", 0, 0, {}]]]}, {"name": "Right_PW_BN_8", "class_name": "BatchNormalization", "config": {"name": "Right_PW_BN_8", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_PW_8", 0, 0, {}]]]}, {"name": "Left_PW_act_8", "class_name": "Activation", "config": {"name": "Left_PW_act_8", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_PW_BN_8", 0, 0, {}]]]}, {"name": "Right_PW_act_8", "class_name": "Activation", "config": {"name": "Right_PW_act_8", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_PW_BN_8", 0, 0, {}]]]}, {"name": "Left_DS_9", "class_name": "DepthwiseConv2D", "config": {"name": "Left_DS_9", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Left_PW_act_8", 0, 0, {}]]]}, {"name": "Right_DS_9", "class_name": "DepthwiseConv2D", "config": {"name": "Right_DS_9", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "inbound_nodes": [[["Right_PW_act_8", 0, 0, {}]]]}, {"name": "Left_DS_BN_9", "class_name": "BatchNormalization", "config": {"name": "Left_DS_BN_9", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Left_DS_9", 0, 0, {}]]]}, {"name": "Right_DS_BN_9", "class_name": "BatchNormalization", "config": {"name": "Right_DS_BN_9", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Right_DS_9", 0, 0, {}]]]}, {"name": "Left_DS_act_9", "class_name": "Activation", "config": {"name": "Left_DS_act_9", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Left_DS_BN_9", 0, 0, {}]]]}, {"name": "Right_DS_act_9", "class_name": "Activation", "config": {"name": "Right_DS_act_9", "trainable": true, "dtype": "float32", "activation": "elu"}, "inbound_nodes": [[["Right_DS_BN_9", 0, 0, {}]]]}, {"name": "Left_PW_9", "class_name": "Conv2D", "config": {"name": "Left_PW_9", "trainable": true, "dtype": "float32", "filters": 